
{
  "κλειδί": "τιμή",
  "κλειδιά": "πρέπει πάντα να περιβάλονται από διπλά quotes",
  "νούμερα": 0,
  "συμβολοσειρές": "Γεια, κόσμε. Οι χαρακτήρες unicode επιτρέπονται, καθώς και το \"escaping\".",
  "διαδικές τιμές": true,
  "κενό": null,
  "μεγάλοι αριθμοί": 1.2e+100,
  "αντικείμενα": {
    "σχόλια": "Σήμερα έφαγα ένα μήλο.",
    "πίνακες": [0, 1, 2, 3, "Οι πίνακες μπορούνε να περιλαμβάνουν διαφορετικούς τύπους δεδομένων", 5],
    "αντικείμενα μέσα σε αντικείμενα": {
      "σχόλια": "Τα αντικείμενα μπορούνε να εσωκλύουν αντικείμενα."
    }
  },
  

  "κενό διάστημα": "Αναγνωρίζεται χωρίς πρόβλημα αλλά καλύτερα να αποφεύγεται η χρήση του.",
  "αυτό ήταν": "Πλέον γνωρίζετε πως μπορείτε να χρησιμοποιήσετε το JSON."
}

